In [2]:
import pandas as pd

ratings1 = pd.read_csv('data/ratings1.csv', sep=',')
ratings2 = pd.read_csv('data/ratings2.csv', sep=',')
dates = pd.read_csv('data/dates.csv', sep=',')
move_dat = pd.read_csv('data/movies.csv', sep=',')#, index_col='movieId')

userId — уникальный идентификатор пользователя, который выставил оценку;
movieId — уникальный идентификатор фильма;
rating — рейтинг фильма

movieId — уникальный идентификатор фильма;
title — название фильма и год его выхода;
genres — жанры фильма.

concat() объединить в одну

по умолчанию вертикално(по столбцам) и нумерацию не трогаем

In [3]:
ratings = pd.concat([ratings1, ratings2])
print(ratings1.shape)
print(ratings2.shape)
print(ratings.shape)
display(ratings)

(40001, 3)
(60836, 3)
(100837, 3)

       userId  movieId  rating
0           1        1     4.0
1           1        3     4.0
2           1        6     4.0
3           1       47     5.0
4           1       50     5.0
...       ...      ...     ...
60831     610   166534     4.0
60832     610   168248     5.0
60833     610   168250     5.0
60834     610   168252     5.0
60835     610   170875     3.0

[100837 rows x 3 columns]

ignore_index=True  нумеровать занова

In [4]:
ratings = pd.concat([ratings1, ratings2],ignore_index=True)
print(ratings1.shape)
print(ratings2.shape)
print(ratings.shape)
display(ratings)

(40001, 3)
(60836, 3)
(100837, 3)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

полеченая таблици и таблицы с датой разная длинна(строки не совпадают)

In [5]:
print('Число строк в таблице ratings: ', ratings.shape[0])
print('Число строк в таблице dates: ', dates.shape[0])
print(ratings.shape[0] == dates.shape[0])

# Число строк в таблице ratings: 100837
# Число строк в таблице dates: 100836
# False

Число строк в таблице ratings:  100837
Число строк в таблице dates:  100836
False

у нас в конце таблицы 
и вначале другой таблици
одна и таже запись

In [6]:
display(ratings1.tail(1))
display(ratings2.head(1))

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

drop_duplicates()    удаляем дубли

ignore_index=True  нумеровать занова

In [7]:
ratings = ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', ratings.shape[0])
# Число строк в таблице ratings: 100836

Число строк в таблице ratings:  100836

In [8]:
ratings_dates = pd.concat([ratings, dates], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                 date
100829     610   164179     5.0  2017-05-03 21:07:11
100830     610   166528     4.0  2017-05-04 06:29:25
100831     610   166534     4.0  2017-05-03 21:53:22
100832     610   168248     5.0  2017-05-03 22:21:31
100833     610   168250     5.0  2017-05-08 19:50:47
100834     610   168252     5.0  2017-05-03 21:19:12
100835     610   170875     3.0  2017-05-03 21:20:15

6.3

In [9]:
import os

def concat_user_files(path): #path — путь до директории
    list_fil=os.listdir(path) # надо error
    list_fil.sort()
    Bool_pd=True
    
    for nama_fil in list_fil:
        nama_put = path+'/'+nama_fil
        temp = pd.read_csv(nama_put, sep=',')
        if Bool_pd:
            result = temp.copy()
            Bool_pd=False
        else:
            result = pd.concat([result, temp]) 
    
    # result.sort_values(by='rating', inplace=True,)       
    result=result.drop_duplicates(ignore_index=True)
    return result
    
concat_user_files('data_dz_6.3')

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100836 rows x 3 columns]

In [40]:
list_x=['id001','id002','id003','id004','id005','id006','id009','id0010','id005','id007','id008']
list_sr=pd.Series( data = list_x)

list_sr.sort_values(key=lambda x:list(map(lambda a:int(a[3:]),x)))

0      id001
1      id002
2      id003
3      id004
4      id005
8      id005
5      id006
9      id007
10     id008
6      id009
7     id0010
dtype: object